package com.study.java_study.ch06_배열;

public class 발표 {
//
////    가장 먼저 배열을 이용하기 위해서는 선언과 생성으로 배열을 만들어야 하는데요
////    이런 형태로 배열을 만들 수 있습니다.
//    int[] nums = new int[3];
////    선언            생성
//
////  데이터타입[] 변수명 = new 데이터타입[배열크기];
//
//// 여기서 int 대괄호 nums부분이 선언, new int 대괄호안에 3이 있는 게 생성하는 곳이라서 이렇게 선언과 생성을 해서 배열을 만들 수 있습니다.
//// 여기서 nums앞에 이 int부분은 배열에 저장될 데이터의 타입을 말합니다.
//
//    int[] nums = new int[3];
//    String[] strs = new String[3];
//    double[] dNums = new double[3];
//
//// 그래서 이렇게 int타입 말고도 String타입, double타입의 데이터도 배열에 저장할 수 있습니다.
//
//
//    int[] nums = new int[3];
////    선언            생성
//
////  데이터타입[] 변수명 = new 데이터타입[배열크기];
//
//
//// 그 다음에 여기서 new int 대괄호안에 3를 넣었는데 이렇게 하면 데이터를 저장할 수 있는 공간이 3개가 있는 배열이 생성됩니다.
//
//    int[] nums = new int[3];
////    선언            생성
//
////  데이터타입[] 변수명 = new 데이터타입[배열크기];
//
////    (네모 3개로 나뉜 데이터공간 사진, 밑에 인덱스번호 적혀있는 )
//
//
//// 그리고 이 공간에는 각각 번호가 메겨져 있는데 그 번호가 인덱스 번호입니다.
//// 인덱스 번호는 0번부터 시작합니다. 그래서 여기서는 공간이 3개가 있지만 인덱스 번호는 0에서 부터 2까지가 됩니다.
//
//    String[] strs = new String[3];
//
//    strs[0] = "가나다";
//    strs[1] = "라마바";
//    strs[2] = "사아자";
//
//
//// 그래서 이 생성한 배열에 값을 집어넣을 수 있습니다.
//
//
//// 이렇게 앞에서 배열의 선언과 생성을 했고 그 다음에 배열에 값을 넣어봤는데
//// 배열을 생성하는 방법이 한 가지 더 있습니다.
//// 앞에서 처럼 생성한다음에 값을 넣는게 아니라 생성과 동시에 값을 넣는 방법입니다.
//
//
//    String[] strs = {"가나다", "라마바", "사아자"};
//
//
//// 바로 이렇게 배열 생성과 동시에 값을 넣어서 배열의 크기도 값 만큼 늘어나게 만들 수 있습니다.
//
//
//    String[] strs = {"가나다", "라마바", "사아자"};
//
//    String[] strs =  new String[] {"가나다", "라마바", "사아자"};
//
//// 여기서 가운데 new String[]은 생략이 가능해서 첫 째 줄처럼 써도 되지만
//
//// 저 new String의 괄호안에 배열의 크기를 입력하는건 문법상 안됩니다.


}
